Have you rebase master branch?? As tested, working fine using this initial tf file...

```
resource "rancher2_cluster_template" "cluster-template-k8s" {
  name = "cluster-template-k8s"
  template_revisions {
    name = "v1"
    default = true
    enabled = true
    cluster_config {
      cluster_auth_endpoint {
          enabled = true
      }
      default_cluster_role_for_project_members = null
      default_pod_security_policy_template_id = null
      desired_agent_image = ""
      desired_auth_image = ""
      docker_root_dir = "/var/lib/docker"
      enable_cluster_alerting = false
      enable_cluster_monitoring = true
      enable_network_policy = false
      rke_config {
        ignore_docker_version = true
        addon_job_timeout = "30"
        kubernetes_version = "v1.17.6-rancher2-1"
        #prefix_path
        ssh_agent_auth = "false"
        authentication {
            strategy = "x509|webhook"
        }
        monitoring {
            provider = "metrics-server"
        }
        ingress {
            provider = "nginx"
            node_selector = {
                app = "ingress"
            }

          }
        network {
          plugin = "canal"
        }
        services {
          etcd {
            creation = "12h"
            retention = "72h"
            snapshot = false
            backup_config {
                enabled = true
                interval_hours = "12"
                retention = "6"
                safe_timestamp = false
            }
          }
          kube_api {
              service_node_port_range = "30000-32767"
              pod_security_policy = false
              always_pull_images = false
          }
        }
        upgrade_strategy {
          drain = true
          max_unavailable_worker = "10%"
          max_unavailable_controlplane = "1"
          drain_input {
              delete_local_data = false
              force = false
              grace_period = "-1"
              ignore_daemon_sets = true
              timeout = "120"
          }
        }
      }
      scheduled_cluster_scan {
        enabled = true
        scan_config {
          cis_scan_config {
            debug_master = false
            debug_worker = false
            override_benchmark_version = "rke-cis-1.4"
            profile = "permissive"
          }
        }
        schedule_config {
          cron_schedule = "0 0 * * *"
          retention = "24"
        }
      }
    }
  }
  description = "Terraform cluster template cluster-template-k8s"
}

resource "rancher2_cluster" "cluster-test" {
  name = "cluster-terraform-vsphere-test"
  cluster_template_id = rancher2_cluster_template.cluster-template-k8s.id
  cluster_template_revision_id = rancher2_cluster_template.cluster-template-k8s.template_revisions.0.id
  lifecycle {
    ignore_changes = [
    enable_cluster_monitoring,
    scheduled_cluster_scan,
    ]
  }
}
```

Once applied, adding second revision

```
resource "rancher2_cluster_template" "cluster-template-k8s" {
  name = "cluster-template-k8s"
  template_revisions {
    name = "v1"
    default = true
    enabled = true
    cluster_config {
      cluster_auth_endpoint {
          enabled = true
      }
      default_cluster_role_for_project_members = null
      default_pod_security_policy_template_id = null
      desired_agent_image = ""
      desired_auth_image = ""
      docker_root_dir = "/var/lib/docker"
      enable_cluster_alerting = false
      enable_cluster_monitoring = true
      enable_network_policy = false
      rke_config {
        ignore_docker_version = true
        addon_job_timeout = "30"
        kubernetes_version = "v1.17.6-rancher2-1"
        #prefix_path
        ssh_agent_auth = "false"
        authentication {
            strategy = "x509|webhook"
        }
        monitoring {
            provider = "metrics-server"
        }
        ingress {
            provider = "nginx"
            node_selector = {
                app = "ingress"
            }

          }
        network {
          plugin = "canal"
        }
        services {
          etcd {
            creation = "12h"
            retention = "72h"
            snapshot = false
            backup_config {
                enabled = true
                interval_hours = "12"
                retention = "6"
                safe_timestamp = false
            }
          }
          kube_api {
              service_node_port_range = "30000-32767"
              pod_security_policy = false
              always_pull_images = false
          }
        }
        upgrade_strategy {
          drain = true
          max_unavailable_worker = "10%"
          max_unavailable_controlplane = "1"
          drain_input {
              delete_local_data = false
              force = false
              grace_period = "-1"
              ignore_daemon_sets = true
              timeout = "120"
          }
        }
      }
      scheduled_cluster_scan {
        enabled = true
        scan_config {
          cis_scan_config {
            debug_master = false
            debug_worker = false
            override_benchmark_version = "rke-cis-1.4"
            profile = "permissive"
          }
        }
        schedule_config {
          cron_schedule = "0 0 * * *"
          retention = "24"
        }
      }
    }
  }
  template_revisions {
    name = "v2"
    default = false
    enabled = true
    #labels = {    }
    cluster_config {
      cluster_auth_endpoint {
          enabled = true
      }
      default_cluster_role_for_project_members = null
      default_pod_security_policy_template_id = null
      desired_agent_image = ""
      desired_auth_image = ""
      docker_root_dir = "/var/lib/docker"
      enable_cluster_alerting = false
      enable_cluster_monitoring = true
      enable_network_policy = false
      rke_config {
        ignore_docker_version = true
        addon_job_timeout = "30"
        kubernetes_version = "v1.17.6-rancher2-1"
        #prefix_path
        ssh_agent_auth = "false"
        authentication {
            strategy = "x509|webhook"
        }
        monitoring {
            provider = "metrics-server"
        }
        ingress {
            provider = "nginx"
            node_selector = {
                app = "ingress"
            }

          }
        network {
          plugin = "canal"
        }
        services {
          etcd {
            creation = "12h"
            retention = "72h"
            snapshot = false
            backup_config {
                enabled = true
                interval_hours = "12"
                retention = "6"
                safe_timestamp = false
            }
          }
          kube_api {
              service_node_port_range = "30000-32767"
              pod_security_policy = false
              always_pull_images = false
          }
        }
        upgrade_strategy {
          drain = true
          max_unavailable_worker = "10%"
          max_unavailable_controlplane = "1"
          drain_input {
              delete_local_data = false
              force = false
              grace_period = "-1"
              ignore_daemon_sets = true
              timeout = "120"
          }
        }
      }
      scheduled_cluster_scan {
        enabled = true
        scan_config {
          cis_scan_config {
            debug_master = false
            debug_worker = false
            override_benchmark_version = "rke-cis-1.4"
            profile = "permissive"
          }
        }
        schedule_config {
          cron_schedule = "0 0 * * *"
          retention = "24"
        }
      }
    }
  }
  description = "Terraform cluster template cluster-template-k8s"
}

resource "rancher2_cluster" "cluster-test" {
  name = "cluster-terraform-vsphere-test"
  cluster_template_id = rancher2_cluster_template.cluster-template-k8s.id
  cluster_template_revision_id = rancher2_cluster_template.cluster-template-k8s.template_revisions.0.id
  lifecycle {
    ignore_changes = [
    enable_cluster_monitoring,
    scheduled_cluster_scan,
    ]
  }
}
```

Applying again and revision got updated fine..

```
terraform apply
rancher2_cluster_template.cluster-template-k8s: Refreshing state... [id=cattle-global-data:ct-2ngg2]
rancher2_cluster.cluster-test: Refreshing state... [id=c-tdhnl]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # rancher2_cluster_template.cluster-template-k8s will be updated in-place
  ~ resource "rancher2_cluster_template" "cluster-template-k8s" {
        annotations         = {}
        default_revision_id = "cattle-global-data:ctr-7smzg"
        description         = "Terraform cluster template cluster-template-k8s"
        id                  = "cattle-global-data:ct-2ngg2"
        labels              = {
            "cattle.io/creator" = "norman"
        }
        name                = "cluster-template-k8s"

        template_revisions {
            annotations         = {}
            cluster_template_id = "cattle-global-data:ct-2ngg2"
            default             = true
            enabled             = true
            id                  = "cattle-global-data:ctr-7smzg"
            labels              = {
                "io.cattle.field/clusterTemplateId" = "ct-2ngg2"
            }
            name                = "v1"

            cluster_config {
                docker_root_dir           = "/var/lib/docker"
                enable_cluster_alerting   = false
                enable_cluster_monitoring = true
                enable_network_policy     = false
                windows_prefered_cluster  = false

                cluster_auth_endpoint {
                    enabled = true
                }

                rke_config {
                    addon_job_timeout     = 30
                    addons_include        = []
                    ignore_docker_version = true
                    kubernetes_version    = "v1.17.6-rancher2-1"
                    ssh_agent_auth        = false

                    authentication {
                        sans     = []
                        strategy = "x509|webhook"
                    }

                    ingress {
                        extra_args    = {}
                        node_selector = {
                            "app" = "ingress"
                        }
                        options       = {}
                        provider      = "nginx"
                    }

                    monitoring {
                        node_selector = {}
                        options       = {}
                        provider      = "metrics-server"
                        replicas      = 0
                    }

                    network {
                        mtu     = 0
                        options = {}
                        plugin  = "canal"
                    }

                    services {
                        etcd {
                            creation      = "12h"
                            external_urls = []
                            extra_args    = {
                                "election-timeout"   = "5000"
                                "heartbeat-interval" = "500"
                            }
                            extra_binds   = []
                            extra_env     = []
                            gid           = 0
                            retention     = "72h"
                            snapshot      = false
                            uid           = 0

                            backup_config {
                                enabled        = true
                                interval_hours = 12
                                retention      = 6
                                safe_timestamp = false
                            }
                        }

                        kube_api {
                            admission_configuration = {}
                            always_pull_images      = false
                            extra_args              = {}
                            extra_binds             = []
                            extra_env               = []
                            pod_security_policy     = false
                            service_node_port_range = "30000-32767"
                        }
                    }

                    upgrade_strategy {
                        drain                        = true
                        max_unavailable_controlplane = "1"
                        max_unavailable_worker       = "10%"

                        drain_input {
                            delete_local_data  = false
                            force              = false
                            grace_period       = -1
                            ignore_daemon_sets = true
                            timeout            = 120
                        }
                    }
                }

                scheduled_cluster_scan {
                    enabled = true

                    scan_config {
                        cis_scan_config {
                            debug_master               = false
                            debug_worker               = false
                            override_benchmark_version = "rke-cis-1.4"
                            override_skip              = []
                            profile                    = "permissive"
                        }
                    }

                    schedule_config {
                        cron_schedule = "0 0 * * *"
                        retention     = 24
                    }
                }
            }
        }
      + template_revisions {
          + annotations = (known after apply)
          + default     = false
          + enabled     = true
          + labels      = (known after apply)
          + name        = "v2"

          + cluster_config {
              + docker_root_dir           = "/var/lib/docker"
              + enable_cluster_alerting   = false
              + enable_cluster_monitoring = true
              + enable_network_policy     = false
              + windows_prefered_cluster  = false

              + cluster_auth_endpoint {
                  + enabled = true
                }

              + rke_config {
                  + addon_job_timeout     = 30
                  + ignore_docker_version = true
                  + kubernetes_version    = "v1.17.6-rancher2-1"
                  + ssh_agent_auth        = false

                  + authentication {
                      + sans     = (known after apply)
                      + strategy = "x509|webhook"
                    }

                  + authorization {
                      + mode    = (known after apply)
                      + options = (known after apply)
                    }

                  + bastion_host {
                      + address        = (known after apply)
                      + port           = (known after apply)
                      + ssh_agent_auth = (known after apply)
                      + ssh_key        = (sensitive value)
                      + ssh_key_path   = (known after apply)
                      + user           = (known after apply)
                    }

                  + cloud_provider {
                      + custom_cloud_provider = (known after apply)
                      + name                  = (known after apply)

                      + aws_cloud_provider {
                          + global {
                              + disable_security_group_ingress = (known after apply)
                              + disable_strict_zone_check      = (known after apply)
                              + elb_security_group             = (known after apply)
                              + kubernetes_cluster_id          = (known after apply)
                              + kubernetes_cluster_tag         = (known after apply)
                              + role_arn                       = (known after apply)
                              + route_table_id                 = (known after apply)
                              + subnet_id                      = (known after apply)
                              + vpc                            = (known after apply)
                              + zone                           = (known after apply)
                            }

                          + service_override {
                              + region         = (known after apply)
                              + service        = (known after apply)
                              + signing_method = (known after apply)
                              + signing_name   = (known after apply)
                              + signing_region = (known after apply)
                              + url            = (known after apply)
                            }
                        }

                      + azure_cloud_provider {
                          + aad_client_cert_password         = (sensitive value)
                          + aad_client_cert_path             = (known after apply)
                          + aad_client_id                    = (sensitive value)
                          + aad_client_secret                = (sensitive value)
                          + cloud                            = (known after apply)
                          + cloud_provider_backoff           = (known after apply)
                          + cloud_provider_backoff_duration  = (known after apply)
                          + cloud_provider_backoff_exponent  = (known after apply)
                          + cloud_provider_backoff_jitter    = (known after apply)
                          + cloud_provider_backoff_retries   = (known after apply)
                          + cloud_provider_rate_limit        = (known after apply)
                          + cloud_provider_rate_limit_bucket = (known after apply)
                          + cloud_provider_rate_limit_qps    = (known after apply)
                          + load_balancer_sku                = (known after apply)
                          + location                         = (known after apply)
                          + maximum_load_balancer_rule_count = (known after apply)
                          + primary_availability_set_name    = (known after apply)
                          + primary_scale_set_name           = (known after apply)
                          + resource_group                   = (known after apply)
                          + route_table_name                 = (known after apply)
                          + security_group_name              = (known after apply)
                          + subnet_name                      = (known after apply)
                          + subscription_id                  = (sensitive value)
                          + tenant_id                        = (sensitive value)
                          + use_instance_metadata            = (known after apply)
                          + use_managed_identity_extension   = (known after apply)
                          + vm_type                          = (known after apply)
                          + vnet_name                        = (known after apply)
                          + vnet_resource_group              = (known after apply)
                        }

                      + openstack_cloud_provider {
                          + block_storage {
                              + bs_version        = (known after apply)
                              + ignore_volume_az  = (known after apply)
                              + trust_device_path = (known after apply)
                            }

                          + global {
                              + auth_url    = (known after apply)
                              + ca_file     = (known after apply)
                              + domain_id   = (sensitive value)
                              + domain_name = (known after apply)
                              + password    = (sensitive value)
                              + region      = (known after apply)
                              + tenant_id   = (sensitive value)
                              + tenant_name = (known after apply)
                              + trust_id    = (sensitive value)
                              + username    = (sensitive value)
                            }

                          + load_balancer {
                              + create_monitor         = (known after apply)
                              + floating_network_id    = (known after apply)
                              + lb_method              = (known after apply)
                              + lb_provider            = (known after apply)
                              + lb_version             = (known after apply)
                              + manage_security_groups = (known after apply)
                              + monitor_delay          = (known after apply)
                              + monitor_max_retries    = (known after apply)
                              + monitor_timeout        = (known after apply)
                              + subnet_id              = (known after apply)
                              + use_octavia            = (known after apply)
                            }

                          + metadata {
                              + request_timeout = (known after apply)
                              + search_order    = (known after apply)
                            }

                          + route {
                              + router_id = (known after apply)
                            }
                        }

                      + vsphere_cloud_provider {
                          + disk {
                              + scsi_controller_type = (known after apply)
                            }

                          + global {
                              + datacenters          = (known after apply)
                              + insecure_flag        = (known after apply)
                              + password             = (sensitive value)
                              + port                 = (known after apply)
                              + soap_roundtrip_count = (known after apply)
                              + user                 = (sensitive value)
                            }

                          + network {
                              + public_network = (known after apply)
                            }

                          + virtual_center {
                              + datacenters          = (known after apply)
                              + name                 = (known after apply)
                              + password             = (sensitive value)
                              + port                 = (known after apply)
                              + soap_roundtrip_count = (known after apply)
                              + user                 = (sensitive value)
                            }

                          + workspace {
                              + datacenter        = (known after apply)
                              + default_datastore = (known after apply)
                              + folder            = (known after apply)
                              + resourcepool_path = (known after apply)
                              + server            = (known after apply)
                            }
                        }
                    }

                  + dns {
                      + node_selector        = (known after apply)
                      + provider             = (known after apply)
                      + reverse_cidrs        = (known after apply)
                      + upstream_nameservers = (known after apply)

                      + nodelocal {
                          + ip_address    = (known after apply)
                          + node_selector = (known after apply)
                        }
                    }

                  + ingress {
                      + extra_args    = (known after apply)
                      + node_selector = {
                          + "app" = "ingress"
                        }
                      + options       = (known after apply)
                      + provider      = "nginx"
                    }

                  + monitoring {
                      + options  = (known after apply)
                      + provider = "metrics-server"
                    }

                  + network {
                      + mtu     = 0
                      + options = (known after apply)
                      + plugin  = "canal"
                    }

                  + services {
                      + etcd {
                          + creation   = "12h"
                          + extra_args = (known after apply)
                          + gid        = 0
                          + retention  = "72h"
                          + snapshot   = false
                          + uid        = 0

                          + backup_config {
                              + enabled        = true
                              + interval_hours = 12
                              + retention      = 6
                              + safe_timestamp = false
                            }
                        }

                      + kube_api {
                          + always_pull_images      = false
                          + extra_args              = (known after apply)
                          + pod_security_policy     = false
                          + service_node_port_range = "30000-32767"
                        }

                      + kube_controller {
                          + cluster_cidr             = (known after apply)
                          + extra_args               = (known after apply)
                          + extra_binds              = (known after apply)
                          + extra_env                = (known after apply)
                          + image                    = (known after apply)
                          + service_cluster_ip_range = (known after apply)
                        }

                      + kubelet {
                          + cluster_dns_server           = (known after apply)
                          + cluster_domain               = (known after apply)
                          + extra_args                   = (known after apply)
                          + extra_binds                  = (known after apply)
                          + extra_env                    = (known after apply)
                          + fail_swap_on                 = (known after apply)
                          + generate_serving_certificate = (known after apply)
                          + image                        = (known after apply)
                          + infra_container_image        = (known after apply)
                        }

                      + kubeproxy {
                          + extra_args  = (known after apply)
                          + extra_binds = (known after apply)
                          + extra_env   = (known after apply)
                          + image       = (known after apply)
                        }

                      + scheduler {
                          + extra_args  = (known after apply)
                          + extra_binds = (known after apply)
                          + extra_env   = (known after apply)
                          + image       = (known after apply)
                        }
                    }

                  + upgrade_strategy {
                      + drain                        = true
                      + max_unavailable_controlplane = "1"
                      + max_unavailable_worker       = "10%"

                      + drain_input {
                          + delete_local_data  = false
                          + force              = false
                          + grace_period       = -1
                          + ignore_daemon_sets = true
                          + timeout            = 120
                        }
                    }
                }

              + scheduled_cluster_scan {
                  + enabled = true

                  + scan_config {
                      + cis_scan_config {
                          + debug_master               = false
                          + debug_worker               = false
                          + override_benchmark_version = "rke-cis-1.4"
                          + profile                    = "permissive"
                        }
                    }

                  + schedule_config {
                      + cron_schedule = "0 0 * * *"
                      + retention     = 24
                    }
                }
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_cluster_template.cluster-template-k8s: Modifying... [id=cattle-global-data:ct-2ngg2]
rancher2_cluster_template.cluster-template-k8s: Modifications complete after 1s [id=cattle-global-data:ct-2ngg2]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

